[{"description":"Build a complete Chugli.ai Voice AI Platform dashboard website with a dark theme. Use the logo at /home/user/Images/chugli-logo-speech-wave-lrJ6m_0uOCFqaG1qx7mld.png as the brand logo.\n\nColor scheme:\n- Dark background: #0F0D1A (near black with purple tint)\n- Card backgrounds: #1A1625 \n- Border/accent: #252136\n- Primary purple: #6B21A8 to #7C3AED gradient\n- Accent purple: #A78BFA\n- Text: White for headings, gray-400 for secondary\n\nPages needed:\n\n1. LOGIN PAGE (/login):\n- Centered card on dark background\n- Logo at top\n- Email and password fields with dark inputs\n- 'Sign In' button with purple gradient\n- Link to signup page\n- Clean, minimal, user-friendly\n\n2. SIGNUP PAGE (/signup):\n- Same style as login\n- Name, email, password fields\n- 'Create Account' button\n- Link to login page\n\n3. DASHBOARD PAGE (/dashboard):\n- Top navigation bar with logo on left, user avatar/logout on right\n- Welcome message with user name\n- 'Add Website' button (prominent, purple)\n- Grid of website cards showing:\n  - Website name and URL\n  - Status badge (color-coded: yellow=pending, blue=scraping, green=ready, red=error)\n  - 'View Agent' and 'Re-scrape' action buttons\n- Empty state when no websites added\n\n4. ADD WEBSITE MODAL/PAGE:\n- Modal overlay or dedicated page\n- URL input field\n- Website name input field\n- Submit button\n- Cancel option\n\n5. AGENT DETAILS PAGE (/agents/:id):\n- Back button to dashboard\n- Agent status with colored indicator\n- Embed code section with copy button\n- Code displayed in monospace font on darker background\n- Success toast when copied\n\nGeneral requirements:\n- Very user-friendly and intuitive navigation\n- Smooth hover states and transitions\n- Responsive design (mobile-friendly)\n- Loading states with spinners\n- Status badges should be pill-shaped with subtle colored backgrounds\n- Use Inter font for text\n- All inputs should have focus states with purple ring\n- Cards should have subtle hover effect","type":"feature","passes":true,"id":1},{"description":"Fix the logo image - it should display the Chugli.ai logo from the public folder (chugli-logo-speech-wave-lrJ6m_0uOCFqaG1qx7mld.png). Make sure the image path is correct and the logo displays properly in the navbar and auth pages.","type":"bug","passes":true,"id":2},{"description":"Fix the copy embed code functionality - the copy button should actually copy the embed code to clipboard and show a success toast/feedback when clicked.","type":"bug","passes":true,"id":3},{"description":"Redesign the UI to be more funky, creative and realistic while keeping the dark theme. Make it feel more alive and premium:\n\n- Add animated gradient backgrounds with subtle moving purple/blue waves or aurora effects\n- Use glassmorphism effects on cards (backdrop blur, semi-transparent backgrounds)\n- Add subtle particle effects or floating orbs in the background\n- Make buttons more interesting with gradient borders and glow effects on hover\n- Add micro-interactions and delightful animations throughout\n- Use creative card designs with gradient borders or neon-style accents\n- Add animated status indicators (pulsing dots, wave animations)\n- Include decorative elements like grid patterns, dot patterns, or circuit-like designs in backgrounds\n- Make the empty state more visually interesting with illustrations or animations\n- Add smooth page transitions\n- Use creative typography with gradient text for headings\n- Add hover effects that feel satisfying (scale, glow, color shifts)\n- Make the overall feel more like a premium SaaS product with personality","type":"feature","passes":true,"id":4},{"description":"Rebrand the entire website from Chugli.ai to Zukii. Replace all instances of 'Chugli.ai' or 'Chugli' with 'Zukii'. Update the logo to use zukii-logo.png from the public folder. Update any taglines or descriptions to reflect the Zukii brand name.","type":"feature","passes":true,"id":5},{"description":"Create a stunning landing page as the homepage (/) that introduces Zukii - Voice AI Platform. The landing page should include:\n\n**Hero Section:**\n- Big bold headline like 'Turn Your Website Into a Voice AI Agent' or 'Your Website, Now With Voice'\n- Subheadline explaining the value prop (scrape website, create AI agent, embed widget)\n- Two CTA buttons: 'Get Started Free' (goes to /signup) and 'See How It Works' (scrolls to features)\n- Animated visual element showing voice waves or AI visualization\n\n**Features Section:**\n- 3-4 feature cards with icons explaining the process:\n  1. Add your website URL\n  2. We scrape and learn your content\n  3. Get an AI voice agent trained on your site\n  4. Embed with one line of code\n- Use funky icons and animations\n\n**How It Works Section:**\n- Step by step visual flow with numbered steps\n- Animated connections between steps\n- Show the journey from URL input to live widget\n\n**Social Proof/Stats Section:**\n- Fake stats like '10,000+ websites powered', '1M+ conversations', '99.9% uptime'\n- Animated counting numbers\n\n**CTA Section:**\n- Final call to action with gradient background\n- 'Start Building Your Voice Agent' button\n- Maybe show embed code preview\n\n**Footer:**\n- Zukii logo\n- Links: Features, Pricing, Login, Signup\n- Copyright\n\n**Navigation:**\n- Sticky navbar with Zukii logo\n- Links: Features, How It Works, Pricing\n- Login and 'Get Started' buttons on right\n\nKeep the funky dark theme with aurora effects, glassmorphism, and all the premium animations. Make it feel like a modern SaaS landing page.","type":"feature","passes":true,"id":6},{"description":"Replace the Zukii logo image with the Chugli logo (chugli-logo-speech-wave-lrJ6m_0uOCFqaG1qx7mld.png) but keep the brand name as 'Zukii'. Display the logo image alongside the text 'Zukii' so the name is clearly visible. The logo should appear next to the Zukii text in the navbar, login page, signup page, and landing page.","type":"feature","passes":true,"id":7},{"description":"Add a loading/splash page that shows when the app first loads. It should display the Zukii logo and name with a cool animation (pulsing, glowing, or morphing effect) before transitioning to the main content. Make it feel premium with smooth fade out after 1-2 seconds.","type":"feature","passes":true,"id":8},{"description":"Fix all navigation and make everything functional:\n\n1. Clicking the Zukii logo anywhere should navigate to the landing page (/)\n2. Login page: Sign In button should work and redirect to /dashboard after login\n3. Signup page: Create Account button should work and redirect to /dashboard after signup\n4. 'Don't have an account? Create one' link should go to /signup\n5. 'Already have an account? Sign in' link should go to /login\n6. Landing page 'Get Started Free' button should go to /signup\n7. Landing page 'Login' button should go to /login\n8. Dashboard should check if user is logged in, if not redirect to /login\n9. Logout button should clear auth and redirect to landing page (/)\n10. All navbar links should work (Features, How It Works scroll on landing page, Pricing can be placeholder)\n\nMake sure the auth flow uses localStorage to persist login state.","type":"bug","passes":true,"id":9},{"description":"Make the landing page more visually impressive and cool:\n\n- Add more dramatic animations to the hero section\n- Make the voice wave animation bigger and more prominent\n- Add a demo/preview section showing what the widget looks like\n- Add testimonials section with fake reviews\n- Make scroll animations smoother and more noticeable\n- Add floating elements and particles\n- Make the feature cards more interactive with better hover effects\n- Add a pricing section with 3 tiers (Free, Pro, Enterprise)\n- Overall make it feel like a top-tier SaaS product landing page","type":"feature","passes":true,"id":10},{"description":"Fix the login and signup forms to be fully functional:\n\n1. LOGIN PAGE:\n- Email input field must be typeable (not disabled, not readonly)\n- Password input field must be typeable\n- Remove any placeholder that blocks typing\n- Sign In button should validate fields are not empty, then save user to localStorage and redirect to /dashboard\n- Show error message if fields are empty\n\n2. SIGNUP PAGE:\n- Name input field must be typeable\n- Email input field must be typeable\n- Password input field must be typeable\n- Create Account button should validate fields, save user to localStorage, and redirect to /dashboard\n- Show error message if fields are empty\n\n3. Make sure all input fields:\n- Have proper onChange handlers that update state\n- Are not disabled or readonly\n- Have proper value bindings to state\n- Allow user to type freely\n- Have visible cursor when focused\n\n4. The form submission should:\n- Prevent default form behavior\n- Store auth token and user info in localStorage\n- Navigate to /dashboard on success\n\nThis is critical - users cannot interact with the forms at all right now.","type":"bug","passes":true,"id":11},{"description":"Fix the Zukii logo display - it's showing twice ('Zukii Zukii'). Should only show the logo image once with 'Zukii' text once next to it. Clean up the duplicate.","type":"bug","passes":true,"id":12},{"description":"CRITICAL FIX: The login and signup forms are completely broken - users cannot type in the input fields at all. The inputs appear frozen/disabled even though they shouldn't be.\n\nPlease completely rewrite the login.tsx and signup.tsx pages with simple, working forms:\n\n1. Use basic React controlled inputs with useState\n2. Use simple native HTML <input> elements, NOT any UI library components\n3. Make sure inputs have:\n   - type='text' for email (or type='email')\n   - type='password' for password\n   - value={stateVariable}\n   - onChange={(e) => setStateVariable(e.target.value)}\n   - No disabled prop\n   - No readonly prop\n4. Remove any complex animations or CSS that might interfere with input focus\n5. Use simple inline styles or basic Tailwind classes only\n6. Make sure the form container doesn't have pointer-events: none\n7. Remove the AnimatedBackground component if it's causing issues - use a simple dark background instead\n8. Test that typing works before considering it done\n\nThe forms should be simple and functional first, pretty second. Users must be able to:\n- Click on the email field and type their email\n- Click on the password field and type their password\n- Click the submit button to log in\n\nKeep the dark theme but prioritize functionality over fancy effects.","type":"bug","passes":true,"id":13},{"description":"Add Google Authentication to the login and signup pages:\n\n1. Add a 'Continue with Google' button on both login and signup pages\n2. The button should have the Google 'G' logo icon\n3. Style it with a white/light background to stand out from the dark theme\n4. Add a divider between the Google button and email/password form that says 'or continue with email'\n5. For now, the Google button can simulate login by storing a mock Google user in localStorage and redirecting to dashboard\n6. Make the Google button look professional with hover effects","type":"feature","passes":true,"id":14},{"description":"Create a Profile/Account page at /profile route:\n\n1. Show user avatar (large circle with user initial or profile picture)\n2. Display user name and email\n3. Edit profile section where user can update their name\n4. Account settings section with options like:\n   - Change password (form with current password, new password, confirm password)\n   - Delete account button (with confirmation)\n5. Subscription/Plan section showing current plan (Free tier)\n6. Add a back button to return to dashboard\n7. Style it with the dark theme, glassmorphism cards\n8. Add the profile page to the router in app.tsx","type":"feature","passes":true,"id":15},{"description":"Update the dashboard navbar to have a proper profile dropdown:\n\n1. Clicking the user avatar/icon in the top right should open a dropdown menu\n2. Dropdown should show:\n   - User name and email at top\n   - 'My Profile' link (goes to /profile)\n   - 'Settings' link (goes to /profile)\n   - 'Logout' button\n3. Add smooth animation for dropdown open/close\n4. Close dropdown when clicking outside\n5. Make the avatar show user's initial with a gradient background","type":"feature","passes":true,"id":16},{"description":"Add more animations and visual polish throughout the app:\n\n1. Page transitions - smooth fade/slide when navigating between pages\n2. Button micro-interactions - scale, glow, ripple effects on click\n3. Card hover effects - lift, glow, border shimmer\n4. Loading skeletons - animated placeholder content while loading\n5. Success animations - checkmark animation when actions complete\n6. Floating particles in backgrounds\n7. Smooth scroll animations - elements fade in as they scroll into view\n8. Input focus animations - expanding border, subtle glow\n9. Status badge pulse animations\n10. Avatar glow effect on hover\n11. Staggered list animations - cards appear one by one\n12. Hover tooltips with smooth fade\n13. Modal open/close animations - scale and fade\n14. Make everything feel fluid and premium","type":"feature","passes":true,"id":17}]